bench/results/java11/20260112T185709Z/load.stdout.txt
{"ok": true, "tool": "wrk", "url": "http://localhost:8080/api/gateway/orders", "duration_s": 120, "warmup_s": 60, "concurrency": 25, "threads": 4, "requests_per_sec": 7445.49, "p50": "3.09ms", "p95": "5.15ms", "p99": "5.91ms", "http_non2xx": "na", "socket_errors": {}, "raw_excerpt": "Running 2m test @ http://localhost:8080/api/gateway/orders\n  4 threads and 25 connections\n  Thread Stats   Avg      Stdev     Max   +/- Stdev\n    Latency     3.21ms    0.91ms  19.41ms   71.31%\n    Req/Sec     1.87k   103.11     2.12k    78.27%\n  Latency Distribution\n     50%    3.09ms\n     75%    3.71ms\n     90%    4.39ms\n     99%    5.91ms\n  893763 requests in 2.00m, 203.71MB read\nRequests/sec:   7445.49\nTransfer/sec:      1.70MB"}